Revit 2027 API
BuiltInFailures.SketchFailures.CannotHaveArcsPath3d Property
 Sorry, we can't use arcs here.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotHaveArcsPath3d { get; }
Public Shared ReadOnly Property CannotHaveArcsPath3d As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotHaveArcsPath3d {
	FailureDefinitionId^ get ();
}
static member CannotHaveArcsPath3d : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace